---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassLevelData.MaterialId
source: html/9caa0161-3bd5-3c63-699a-1b79afea3fb6.htm
---
# Autodesk.Revit.DB.Analysis.MassLevelData.MaterialId Property

The ElementId of the visualization material used for the MassLevelData (Mass Floor)

## Syntax (C#)
```csharp
public ElementId MaterialId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input element materialId is not a material element.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null